// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");

// --------------------------------------------------------------
// --------------------------------------------------------------
/* Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.*/
// --------------------------------------------------------------
// --------------------------------------------------------------

Console.Write("Введите число: ");
int n = int.Parse(Console.ReadLine()!);
Console.Write($"{n} ->  ");
for (int i = 1; i <= n; i++)
{
  if (i % 2 == 0)
  {
    Console.Write($"{i}, ");
  }
  // int result = i;
}
Console.WriteLine();