// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");


/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
//                    ||     Sem_3_c#     ||
//                    Семинар от 12.03.23 г.
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */


/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
//      ВВОД и ВЫВОД  ‘String’  в консоль. (как МАССИВ)
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Обращение к строковым символам, похоже на обращение к элементам массива.
*/

// Console.Write("Введите строку, не менее 10 символов:");
// // string n = Console.ReadLine()!;  // Для ввода в консоль, вручную.
// string n = "_Hello Ворк !!!";
// Console.WriteLine($"{n}");
// //                     _       H       e       l       l       o               В       о       р
// Console.WriteLine($"{n[0]}, {n[1]}, {n[2]}, {n[3]}, {n[4]}, {n[5]}, {n[6]}, {n[7]}, {n[8]}, {n[9]}");
// // При выводе строки, любой символ имеет свой индекс !!!

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
//  ВВОД 'String', ВЫВОД ‘Int’ в консоль. + Математические действия.
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Конвертация 'char'->'string'->'int', выводит ВЕРНОЕ значение.
*/

// Console.Write("Введите ЦИФРЫ:");
// string m = "123";
// Console.WriteLine($" {m}");

// Console.WriteLine($"Верно: {Convert.ToInt32(m[2].ToString()) * 5}");  // ПРАВИЛЬНО !!!

// Умножаем на 5 (* 5), просто для проверки, всё ли получилось…
// Символ        ->         Строка          ->          Целое число
// 'char'        ->        'string'         ->             'int'
//  m[0]                m[0].ToString()           ToInt32(m[0].ToString())

//////////////////////////////////////////////////////////////////////
//// При конвертации в 'int', выводится индекс по кодировке UTF-8   //
// Console.WriteLine($"НЕ Верно: {Convert.ToInt32(m[0])} - это индекс по кодировке UTF-8\n");    // НЕ ПРАВИЛЬНО      //

////                                                                //
//// Введите ЦИФРЫ: 123                                             //
//// 49    // ОШИБКА (порядковый номер по кодировке UTF-8)          //
//////////////////////////////////////////////////////////////////////

// 15.40 - 16.50 - 20.00- Как это работает !!! //
// ..._230312(s)-C#/_Урок 3. Базовые алгоритмы. Продолжение.MP4 //

/*
Задача: Найти сумму цифр введённого числа.
*/

// Console.Write("Введите ЦИФРЫ: ");
// string p = Console.ReadLine()!;
// int sum = 0;
// for (int i = 0; i < p.Length; i++)
//     // sum = sum + Convert.ToInt32(p[i].ToString());
//     sum += Convert.ToInt32(p[i].ToString());
// Console.WriteLine($"Сумма ведённых цифр = {sum}");

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 17 (DEMO 3): Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.
*/

// Console.Write("Введите координату X: ");
// double x = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату Y: ");
// double y = Convert.ToDouble(Console.ReadLine());
// while (x == 0)
// {
//   Console.Write("Вы ошиблись!\nВведите координату X: ");
//   x = Convert.ToDouble(Console.ReadLine());
// }
// while (y == 0)
// {
//   Console.Write("Вы ошиблись!\nВведите координату Y: ");
//   y = Convert.ToDouble(Console.ReadLine());
// }
// if (x > 0 && y > 0)
//   Console.WriteLine("I");
// else if (x < 0 && y > 0)
//   Console.WriteLine("II");
// else if (x < 0 && y < 0)
//   Console.WriteLine("III");
// else
//   Console.WriteLine("IV");

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 18: Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
*/

// Мой код.//
// Console.Write("Введите номер четверти плоскости координат: ");
// int x = Convert.ToInt32(Console.ReadLine());

// if (x == 1)
//   Console.WriteLine("x > 0 && y > 0");
// else if (x == 2)
//   Console.WriteLine("x < 0 && y > 0");
// else if (x == 3)
//   Console.WriteLine("x < 0 && y < 0");
// else
//   Console.WriteLine("x > 0 && y < 0");

// Учитель //
// Console.Write("Введите номер четверти: ");
// int x = Convert.ToInt32(Console.ReadLine());

// while (x < 1 || x > 4)      // Пока 'true', работает цикл.
// {
//   Console.Write("Вы ошиблись!\nВведите номер четверти: ");
//   x = Convert.ToInt32(Console.ReadLine());
// }
// if (x == 1)
//   Console.WriteLine("x > 0 and y > 0");
// else if (x == 2)
//   Console.WriteLine("x < 0 and y > 0");
// else if (x == 3)
//   Console.WriteLine("x < 0 and y < 0");
// else
//   Console.WriteLine("x > 0 and y < 0");

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 21: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
Пример:
    A (3,6); B (2,1) -> 5,1
    A (7,-5); B (1,-1) -> 7,21
*/
// Формула на сайте, тут: https://www.fxyz.ru/формулы_по_математике/аналитическая_геометрия/на_плоскости/точки_и_прямые_в_прямоугольной_системе_координат/расстояние_между_двумя_точками/

// Console.Write("Введите координату X(1): ");
// double x1 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату Y(1): ");
// double y1 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату X(2): ");
// double x2 = Convert.ToDouble(Console.ReadLine());
// Console.Write("Введите координату Y(2): ");
// double y2 = Convert.ToDouble(Console.ReadLine());
// double s = Math.Sqrt(Math.Pow(x1 - x2, 2) + Math.Pow(y1 - y2, 2));    // s = √(x1-x2)ˆ2 + (y1-y2)ˆ2
// //         кв.корень(возв.стпнь(что, стпнь)
// Console.WriteLine($"Расстояние между двумя точками = {Math.Round(s, 3)}");    // Math.Round(s) - округление до целой части.
// //                                                 округление(что, 3 псле зпт.)

// 52.30 //

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 22: Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.
Пример:
    5 -> 1, 4, 9, 16, 25.
    2 -> 1, 4.
*/

// Console.Write("Введите число: ");
// int x = Convert.ToInt32(Console.ReadLine());
// for (int i = 1; i <= x; i++)
//   Console.Write($"{Math.Pow(i, 2)} ");
// Console.WriteLine();


// // Console.Clear();
// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());
// for (int i = 1; i <= n; i++)
//   Console.Write($"{i * i} ");
// Console.WriteLine();










// --------------------------------------------------------------

/* // Sem 4
Console.Write("Введите число: ");
int n = Convert.ToInt32(Console.ReadLine());
int i = 0;
while (n > 0)
{
  n = n / 10;
  i++;
}

Console.WriteLine(i); */