// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");


/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
//                    Семинар от 11.03.23 г.
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
//       Случайное число. →     { Random }
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача:
Напишите программу, которая выводит случайное двухзначное число из отрезка [10, 99] и показывает наибольшую цифру числа.
*/

// int n = new Random().Next(10, 100); // [10, 99]
// Console.WriteLine($"Случаной сгенированное число {n}");
// int n1 = n / 10;
// int n2 = n % 10;
// if (n1 > n2)
//   Console.WriteLine(n1);
// else
//   Console.WriteLine(n2);

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 11: Напишите программу, которая выводит случайное трёхзначное число и удаляет вторую цифру этого числа.
Пример:
    456 -> 46
    782 -> 72
    918 -> 98
*/

// int n = new Random().Next(100, 1000); // [10, 99]
// Console.WriteLine($"Случаной сгенированное число {n}");
// int n1 = n / 100;
// int n3 = n % 10;
// Console.WriteLine(n1 * 10 + n3);
// Console.Write(n1);
// Console.WriteLine(n3);

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 12: Напишите программу, которая будет принимать на вход два числа и выводить, является ли второе число кратным первому. Если число 2 не кратно числу 1, то программа выводит остаток от деления.
Пример:
    34, 5 -> не кратно, остаток 4 
    16, 4 -> кратно
*/

// Console.Write("Введите 1-ое число: ");
// int n = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите 2-ое число: ");
// int m = Convert.ToInt32(Console.ReadLine());
// if (n % m == 0)
//   Console.WriteLine("кратно");
// else
//   Console.WriteLine($"не кратно, остаток {n % m}");

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 14: Напишите программу, которая принимает на вход число и проверяет, кратно ли оно одновременно 7 и 23.
Пример:
    14 -> нет 
    46 -> нет 
    161 -> да
*/

// вар.1. - Для ПРОСТЫХ чисел (- делятся 1 и само на себя)
// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());
// if (n % 161 == 0)
//   Console.WriteLine("yes");
// else
//   Console.WriteLine("no");

// вар.2.
// Console.Write("Введите число: ");
// int n = Convert.ToInt32(Console.ReadLine());
// if (n % 7 == 0 && n % 23 == 0)
//   Console.WriteLine("yes");
// else
//   Console.WriteLine("no");

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/*
Задача 16: Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого.
Пример:
    5, 25  ->  да
    -4, 16  ->  да
    25, 5  ->  да
    8,9  ->  нет
*/

// Console.Write("Введите 1-ое число: ");
// int n = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите 2-ое число: ");
// int m = Convert.ToInt32(Console.ReadLine());
// if (n * n == m || m * m == n)
//   Console.WriteLine("yes");
// else
//   Console.WriteLine("no");
// && - и(одновременное выполнение условий)
// || - или(выполнение хотя бы одного из условий)

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */