// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");

// --------------------------------------------------------------
// --------------------------------------------------------------
/* Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.*/
// --------------------------------------------------------------
// --------------------------------------------------------------

Console.Write("Введите число: ");
int n = int.Parse(Console.ReadLine()!);
int n1 = n / 10 % 10;
Console.WriteLine($"{n1}");