// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");

// --------------------------------------------------------------
// --------------------------------------------------------------
/*
Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
*/
// --------------------------------------------------------------
// --------------------------------------------------------------

Console.Write("Введите трёхзначное число: ");
int n = int.Parse(Console.ReadLine()!);
int n1 = n / 10 % 10;
// int n1 = n / 10;
// int n2 = n1 % 10;
Console.WriteLine($"Второе число: {n1}");
// Console.WriteLine($"{n2}");