// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");

// --------------------------------------------------------------
/*
Задача : Задайте массив дробных чисел. Найдите разницу между максимальным и минимальным элементов массива.
Пример:
    [3,01 7,23 22,79 2,38 78,45] -> 76,07
*/
// --------------------------------------------------------------

