// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");


/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
//                    ||     _230308(l)-C#     ||                 //
//                    ||        Лекция.        ||                 //
//         _Урок 2. Знакомство с функциями и массивами.
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

//        Методы (Функции).

/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
//                                                        [00:07:25]
//  Функции в программировании 
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */
/*
Задача:                                                   [00:11:31]
Поищем максимум из 9 чисел.
*/
// --------------------------------------------------------------
/* Решение БЕЗ метода. */
int a11 = 15;
int b11 = 21;
int c11 = 39;    // max
int a12 = 12;
int b12 = 23;
int c12 = 33;
int a13 = 13;
int b13 = 23;
int c13 = 35;

int max = a11;
if (b11 > max) max = b11;
if (c11 > max) max = c11;
if (a12 > max) max = a12;
if (b12 > max) max = b12;
if (c12 > max) max = c12;
if (a13 > max) max = a13;
if (b13 > max) max = b13;
if (c13 > max) max = c13;

Console.WriteLine($"\n{max} --  -- без метода(без функции).");
// --------------------------------------------------------------

// --------------------------------------------------------------
/* Решение С методом. */
// !!! Методы ВСЕГДА пишутся с верху !!! //
// - Методы(функции).-> -> -> -> -> -> -> -> -> -> -> -> -> -> ->
int Max(int arg1, int arg2, int arg3)
{
  int result = arg1;
  if (result < arg2) result = arg2;
  if (result < arg3) result = arg3;
  return result;
}
// <- <- <- <- <- <- <- <- <- <- <- <- <- <- <- Методы(функции) -

int a21 = 15;
int b21 = 21;
int c21 = 39;    // max
int a22 = 12;
int b22 = 23;
int c22 = 33;
int a23 = 13;
int b23 = 23;
int c23 = 35;

int max1 = Max(a21, b21, c21);      //  ! Этот
// Console.WriteLine(max1);         //  ! код
int max2 = Max(a22, b22, c22);      //  ! использует
// Console.WriteLine(max2);         //  ! промежуточные
int max3 = Max(a23, b23, c23);      //  ! переменные.
int maxi = Max(max1, max2, max3);   //  !

// -Так ПРОЩЩЕ и тоже можно- //
// -Так ПРОЩЩЕ и тоже можно- //
int maxim = Max(Max(a21, b21, c21), Max(a22, b22, c22), Max(a23, b23, c23));
// -Так ПРОЩЩЕ и тоже можно- //
// -Так ПРОЩЩЕ и тоже можно- //

Console.WriteLine($"{maxi} -вар.1- с методом(с функцией)");
Console.WriteLine($"{maxim} -вар.2- с методом(с функцией), (1-а строка.)\n");

// --------------------------------------------------------------
/* -+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ */

/* SF OK */