// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");

// --------------------------------------------------------------
/*
Задача : Дана строка, состоящая из N попарно различных символов. Требуется вывести все перестановки символов данной строки.
Пример:
    AB -> AB; BA
    IOX -> IOX; IXO;XOI; XIO; OIX; OXI
*/



// --------------------------------------------------------------
