// See https://aka.ms/new-console-template for more information
// Очистка консоли.
Console.Clear();
// Console.WriteLine("Hello, World!");

// --------------------------------------------------------------
/*
Задача : Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных позициях.
Пример:
    3, 7, 23, 12] -> 19
    [-4, -6, 89, 6] -> 0
*/
// --------------------------------------------------------------

